       IDENTIFICATION DIVISION.
       PROGRAM-ID. nombre.
           
       ENVIRONMENT DIVISION.
      
       DATA DIVISION.
           WORKING-STORAGE SECTION.
            
           PROCEDURE DIVISION.
             
               
     
               STOP RUN.
     
       END PROGRAM nombre.
